# GetName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPerformanceAdviserRule..::..GetName Method
IPerformanceAdviserRule Interface See Also
---
Retrieves the name of the rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
string GetName()
```

Visual Basic
---
```text
Function GetName As String
```

Visual C++
---
```text
String^ GetName()
```

# ### Return Value
The name of the rule.
# Remarks
Method should return a short string naming the rule, typically as a one word in TitleCase. String should be localized.
# See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace